; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-57)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l5)
    (at p3 l11)
    (at p4 l9)
    (at p5 l2)
    (at p6 l8)
    (at p7 l4)
    (at p8 l7)
    (at p9 l1)
    (at p10 l11)
    (at v1 l6)
    (at v2 l1)
    (at v3 l1)
    (at v4 l7)
    (at v5 l5)
    (road l9 l5)
    (road l10 l6)
    (road l9 l11)
    (road l7 l1)
    (road l5 l9)
    (road l4 l11)
    (road l11 l4)
    (road l10 l11)
    (road l11 l10)
    (road l2 l7)
    (road l10 l8)
    (road l6 l10)
    (road l3 l2)
    (road l3 l11)
    (road l11 l3)
    (road l11 l9)
    (road l8 l10)
    (road l2 l3)
    (road l1 l7)
    (road l7 l2)
    (road l3 l4)
    (road l4 l3)
    (road l6 l7)
    (road l7 l6)
    (road l4 l8)
    (road l8 l4)
    (road l6 l11)
    (road l11 l6)
    (road l1 l10)
    (road l10 l1)
    (road l5 l6)
    (road l6 l5)
    (road l7 l8)
    (road l8 l7)
    (road l6 l8)
    (road l8 l6)
    (road l4 l6)
    (road l6 l4)
    (road l3 l5)
    (road l5 l3)
    (road l1 l8)
    (road l8 l1)
    (road l7 l10)
    (road l10 l7)
    (road l5 l7)
    (road l7 l5)
    (road l3 l9)
    (road l9 l3)
    (road l8 l9)
    (road l9 l8)
    (road l2 l8)
    (road l8 l2)
    (road l4 l9)
    (road l9 l4)
    (road l3 l8)
    (road l8 l3)
    (road l7 l9)
    (road l9 l7)
    (road l2 l11)
    (road l11 l2)
    )
 (:goal (and 
(at p1 l7)
(at p2 l11)
(at p3 l4)
(at p4 l11)
))
)

; plan
1. (drive v3 l1 l8)
   deleted: (at v3 l1)
   added: (at v3 l8)
   goals met: 0 of 4
2. (pick-up v3 l8 p1 c1 c2)
   deleted: (at p1 l8) (capacity v3 c2)
   added: (in p1 v3) (capacity v3 c1)
   goals met: 0 of 4
3. (drive v3 l8 l7)
   deleted: (at v3 l8)
   added: (at v3 l7)
   goals met: 0 of 4
4. (drop v3 l7 p1 c1 c2)
   deleted: (in p1 v3) (capacity v3 c1)
   added: (at p1 l7) (capacity v3 c2)
   goals met: 1 of 4
5. (drive v3 l7 l5)
   deleted: (at v3 l7)
   added: (at v3 l5)
   goals met: 1 of 4
6. (pick-up v3 l5 p2 c1 c2)
   deleted: (at p2 l5) (capacity v3 c2)
   added: (in p2 v3) (capacity v3 c1)
   goals met: 1 of 4
7. (drive v3 l5 l9)
   deleted: (at v3 l5)
   added: (at v3 l9)
   goals met: 1 of 4
8. (pick-up v3 l9 p4 c0 c1)
   deleted: (at p4 l9) (capacity v3 c1)
   added: (in p4 v3) (capacity v3 c0)
   goals met: 1 of 4
9. (drive v3 l9 l11)
   deleted: (at v3 l9)
   added: (at v3 l11)
   goals met: 1 of 4
10. (drop v3 l11 p2 c0 c1)
   deleted: (in p2 v3) (capacity v3 c0)
   added: (at p2 l11) (capacity v3 c1)
   goals met: 2 of 4
11. (drop v3 l11 p4 c1 c2)
   deleted: (in p4 v3) (capacity v3 c1)
   added: (at p4 l11) (capacity v3 c2)
   goals met: 3 of 4
12. (pick-up v3 l11 p3 c1 c2)
   deleted: (at p3 l11) (capacity v3 c2)
   added: (in p3 v3) (capacity v3 c1)
   goals met: 3 of 4
13. (drive v3 l11 l4)
   deleted: (at v3 l11)
   added: (at v3 l4)
   goals met: 3 of 4
14. (drop v3 l4 p3 c1 c2)
   deleted: (in p3 v3) (capacity v3 c1)
   added: (at p3 l4) (capacity v3 c2)
   goals met: 4 of 4
